/*codedd bye Amal.
*/
const Asena = require('../events');
const {MessageType} = require('@adiwajshing/baileys');

// Config Checker
const ch = require('../config');

// Languages
const END = "Thats a plugin with enjoyable tools together inside. (Meme Pack V3)"
const MLD =  "ഈ പ്ലഗിൻ നിങ്ങൾ മതിയാവോളം യൂസ് ചെയൂ."
if (ch.LANG === 'EN') {

    if (ch.WORKTYPE === 'private') {
   
        Asena.addCommand({pattern: 'npack', fromMe: true, desc: TRD}, (async (message, match) => {

            await message.sendMessage("_Birbirinden farklı değişik ve eğlenceli araçların bir arada bulunduğu bir plugin._\n🎻Usage: *.m7*\n🎧Desc: *Şekilli olarak doğum günü kutla*\n\n🎻Usage: *.m8*\n🎧Desc: *Biraz silah sıkmaya ne dersin?*\n\n🎻Usage: *.m9*\n🎧Desc: *Seni seviyorum demenin farklı bir yolu*\n\n🎻Usage: *.n1*\n🎧Desc: *Helikopterle inip aşkını açıklamaya ne dersin?*\n\n🎻Usage: *.n2*\n🎧Desc: *Birine kalp gönder bakalım*\n\n🎻Usage: *.n3*\n🎧Desc: *Tank göndermeye ne dersin ?*\n\n🎻Usage: *.n4*\n🎧Desc: *Gs aşkıyla yanıp tutuşanlar için*\n\n🎻Usage: *.n5*\n🎧Desc: *Şekilli disslike göndermeye ne dersin ?*\n\n🎻Usage: *.n6*\n🎧Desc: *Sohbeti neşelendirecek kedi göndermeye ne dersin?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
    else if (ch.WORKTYPE === 'public') {
   
        Asena.addCommand({pattern: 'npack', fromMe: false, desc: TRD}, (async (message, match) => {

            await message.sendMessage("_Birbirinden farklı değişik ve eğlenceli araçların bir arada bulunduğu bir plugin._\n🎻Usage: *.m7*\n🎧Desc: *Şekilli olarak doğum günü kutla*\n\n🎻Usage: *.m8*\n🎧Desc: *Biraz silah sıkmaya ne dersin?*\n\n🎻Usage: *.m9*\n🎧Desc: *Seni seviyorum demenin farklı bir yolu*\n\n🎻Usage: *.n1*\n🎧Desc: *Helikopterle inip aşkını açıklamaya ne dersin?*\n\n🎻Usage: *.n2*\n🎧Desc: *Birine kalp gönder bakalım*\n\n🎻Usage: *.n3*\n🎧Desc: *Tank göndermeye ne dersin ?*\n\n🎻Usage: *.n4*\n🎧Desc: *Gs aşkıyla yanıp tutuşanlar için*\n\n🎻Usage: *.n5*\n🎧Desc: *Şekilli disslike göndermeye ne dersin ?*\n\n🎻Usage: *.n6*\n🎧Desc: *Sohbeti neşelendirecek kedi göndermeye ne dersin?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
}
else if (ch.LANG === 'ML') {

    if (ch.WORKTYPE === 'private') {
   
        Asena.addCommand({pattern: 'npack', fromMe: true, desc: HID}, (async (message, match) => {

            await message.sendMessage("_यह एक प्लगइन के साथ सुखद उपकरण अंदर है। _\n🎻Usage: *.m7*\n🎧Desc: *जन्मदिन मनाएं.*\n\n🎻Usage: *.m8*\n🎧Desc: *थोड़ा शॉट के बारे में कैसे?*\n\n🎻Usage: *.m9*\n🎧Desc: *आई लव यू कहने का एक अलग तरीका*\n\n🎻Usage: *.n1*\n🎧Desc: *कैसे एक हेलीकॉप्टर में उतरने और अपने प्यार का खुलासा करने के बारे में?*\n\n🎻Usage: *.n2*\n🎧Desc: *किसी को दिल भेज दो*\n\n🎻Usage: *.n3*\n🎧Desc: *टैंक भेजने के बारे में कैसे?*\n\n🎻Usage: *.n4*\n🎧Desc: *उन लोगों के लिए जो GS के प्यार से जल रहे हैं*\n\n🎻Usage: *.n5*\n🎧Desc: *नापसंद भेजने के बारे में कैसे?*\n\n🎻Usage: *.n6*\n🎧Desc: *कैसे चैट को खुश करने के लिए एक बिल्ली भेजने के बारे में?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
    else if (ch.WORKTYPE === 'public') {
   
        Asena.addCommand({pattern: 'npack', fromMe: false, desc: HID}, (async (message, match) => {

            await message.sendMessage("_यह एक प्लगइन के साथ सुखद उपकरण अंदर है। _\n🎻Usage: *.m7*\n🎧Desc: *जन्मदिन मनाएं.*\n\n🎻Usage: *.m8*\n🎧Desc: *थोड़ा शॉट के बारे में कैसे?*\n\n🎻Usage: *.m9*\n🎧Desc: *आई लव यू कहने का एक अलग तरीका*\n\n🎻Usage: *.n1*\n🎧Desc: *कैसे एक हेलीकॉप्टर में उतरने और अपने प्यार का खुलासा करने के बारे में?*\n\n🎻Usage: *.n2*\n🎧Desc: *किसी को दिल भेज दो*\n\n🎻Usage: *.n3*\n🎧Desc: *टैंक भेजने के बारे में कैसे?*\n\n🎻Usage: *.n4*\n🎧Desc: *उन लोगों के लिए जो GS के प्यार से जल रहे हैं*\n\n🎻Usage: *.n5*\n🎧Desc: *नापसंद भेजने के बारे में कैसे?*\n\n🎻Usage: *.n6*\n🎧Desc: *कैसे चैट को खुश करने के लिए एक बिल्ली भेजने के बारे में?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
}
else {

    if (ch.WORKTYPE === 'private') {
   
        Asena.addCommand({pattern: 'npack', fromMe: true, desc: END}, (async (message, match) => {

            await message.sendMessage("_Thats a plugin with enjoyable tools together inside._\n🎻Usage: *.m7*\n🎧Desc: *Celebrate a birthday.*\n\n🎻Usage: *.m8*\n🎧Desc: *How about a little shot?*\n\n🎻Usage: *.m9*\n🎧Desc: *A different way to say I love you*\n\n🎻Usage: *.n1*\n🎧Desc: *How about landing in a helicopter and revealing your love?*\n\n🎻Usage: *.n2*\n🎧Desc: *Send someone a heart, let's see what you got.*\n\n🎻Usage: *.n3*\n🎧Desc: *How about sending a tank?*\n\n🎻Usage: *.n4*\n🎧Desc: *For those who are burning with the love of GS*\n\n🎻Usage: *.n5*\n🎧Desc: *How about sending dislike?*\n\n🎻Usage: *.n6*\n🎧Desc: *How about sending a cat to cheer up the chat?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
    else if (ch.WORKTYPE === 'public') {
   
        Asena.addCommand({pattern: 'npack', fromMe: false, desc: END}, (async (message, match) => {

            await message.sendMessage("_Thats a plugin with enjoyable tools together inside._\n🎻Usage: *.m7*\n🎧Desc: *Celebrate a birthday.*\n\n🎻Usage: *.m8*\n🎧Desc: *How about a little shot?*\n\n🎻Usage: *.m9*\n🎧Desc: *A different way to say I love you*\n\n🎻Usage: *.n1*\n🎧Desc: *How about landing in a helicopter and revealing your love?*\n\n🎻Usage: *.n2*\n🎧Desc: *Send someone a heart, let's see what you got.*\n\n🎻Usage: *.n3*\n🎧Desc: *How about sending a tank?*\n\n🎻Usage: *.n4*\n🎧Desc: *For those who are burning with the love of GS*\n\n🎻Usage: *.n5*\n🎧Desc: *How about sending dislike?*\n\n🎻Usage: *.n6*\n🎧Desc: *How about sending a cat to cheer up the chat?*\n\nCodded by *@phaticusthiccy*\nUpdated by *@shadokiller*\nVersiyon: *2.0*");

        }));

        Asena.addCommand({pattern: 'm7', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪\n░H░A░P░P░Y░♪░B░I░R░T░H░D░A░Y░\n♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪");

        }));

        Asena.addCommand({pattern: 'm8', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("\n_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_");

        }));

        Asena.addCommand({pattern: 'm9', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ");

        }));

        Asena.addCommand({pattern: 'n1', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage(" ▬▬▬.◙.▬▬▬\n ═▂▄▄▓▄▄▂\n◢◤ █▀▀████▄▄▄▄◢◤\n█▄▂█ █▄███▀▀▀▀▀▀▀╬\n◥█████◤\n══╩══╩═\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬\n ╬═╬ ☻/\n ╬═╬/▌\n ╬═╬/");

        }));

        Asena.addCommand({pattern: 'n2', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("(っ◔◡◔っ) ❤");

        }));

        Asena.addCommand({pattern: 'n3', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("  ░░░░░░███████ ]▄▄▄▄▄▄▄▄          \n▂▄▅█████████▅▄▃▂   \nIl███████████████████].   ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤..\n");
  
        }));

        Asena.addCommand({pattern: 'n4', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌔🌕🌕🌕🌑🌕🌕🌕🌖🌑\n🌑🌕🌕🌕🌕🌕🌕🌕🌕🌕🌑\n🌑🌔🌕🌕🌕🌕🌕🌕🌕🌖🌑\n🌑🌒🌕🌕🌕🌕🌕🌕🌕🌘🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌒🌕🌕🌕🌕🌕🌘🌑🌑\n🌑🌑🌑🌒🌕🌕🌕🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑\n🌑🌑🌒🌘🌑🌑🌑🌒🌘🌑🌑\n🌑🌒❤️❤️🌘🌑🌒❤️❤️🌘🌑\n🌑🌔❤️❤️🌕🌑❤️❤️❤️🌖🌑\n🌑❤️❤️❤️❤️❤️❤️❤️❤️❤️🌑\n🌑🌔❤️❤️❤️❤️❤️❤️❤️🌖🌑\n🌑🌒❤️❤️❤️❤️❤️❤️❤️🌘🌑\n🌑🌑🌒❤️❤️❤️❤️❤️🌘🌑🌑\n🌑🌑🌑🌒❤️❤️❤️🌘🌑🌑🌑\n🌑🌑🌑🌑🌒🌕🌘🌑🌑🌑🌑\n🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑🌑");

        }));

        Asena.addCommand({pattern: 'n5', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("███████▄▄███████████▄\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n▓▓▓▓▓▓███░░░░░░░░░░░░█\n██████▀░░█░░░░██████▀\n░░░░░░░░░█░░░░█\n░░░░░░░░░░█░░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░█░░█\n░░░░░░░░░░░░▀▀");

        }));

        Asena.addCommand({pattern: 'n6', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

            await message.sendMessage("──────▄▀▄─────▄▀▄\n─────▄█░░▀▀▀▀▀░░█▄\n─▄▄──█░░░░░░░░░░░█──▄▄\n█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█");

        }));

    }
}
